export default {
  main: {
    topInfo: ['设备装机量', '单体电池总数量', '装机总电量', '当前总电量'],
    topBar: ['用户', '设备', '电池', 'UPS', '告警', '站内信', '日志', '备忘'],
    deviceCount: {
      title: '设备统计',
      value: [
        '逆变设备装机数量',
        '消防设备装机数量',
        '控制器在线数量',
        '发电机设备装机数量',
        '光伏设备装机数量',
        '控制器在线率',
        '联动设备装机数量',
        '风能设备装机数量',
        '用户在线数量'
      ]
    },
    energyStatistics: {
      title: '能源统计',
      trend: '电量趋势',
      order: '电量排行榜'
    }
  },
  deviceParams: {
    top: {
      title: '模糊查询',
      lableList: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholderList: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ],
      search: '查询'
    },
    listTitle: '设备管理',
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID字符串',
      'VIN码',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    operation: [
      '更新系统时间',
      '设备软重启'
    ],
    tips: [
      '确定要更新系统时间吗',
      '设备将会软重启,确定要继续吗'
    ],
    cancel: '已取消',
    yes: '确定',
    no: '取消',
    tip: '提示'
  },
  header: {
    search: '请输入您需要查找的内容……',
    close: {
      title: '关闭操作',
      label: ['关闭其他选项卡', '关闭所有选项卡']
    },
    logout: '退出'
  },
  base: {
    submit: '提交',
    cancel: '取消',
    download: '下载',
    search: '模糊查询',
    searchbtn: '查询',
    refresh: '刷新',
    add: '添加',
    del: '删除',
    edit: '编辑',
    multipleAdd: '多条添加',
    multipleDel: '多选删除',
    export: {
      csv: '导出为Csv文件',
      excel: '导出为Excel文件',
      title: '导出',
      print: '打印'
    },
    delConfirm: {
      tip: '是否删除 ',
      tip1: '确定删除吗',
      title: '提示',
      yes: '确定',
      no: '取消',
      cancelTip: '已取消删除'
    },
    datePicker: {
      start: '开始日期',
      end: '结束日期',
      separator: '至'
    },
    dateGroup: {
      today: '当天',
      yesterday: '昨天',
      twoDays: '前两天',
      week: '前一周',
      month: '前一月'
    }
  },
  user: {
    dropdownList: ['修改头像', '个人资料', '联系我们', '收件信箱']
  },
  screenFull: {
    title: '全屏',
    tip: '不支持全屏'
  },
  home: {
    feedback: {
      title: '反馈',
      formLabel: ['标题', '内容'],
      tip: '请输入正文'
    }
  },
  tabName: {
    main: '首页',
    systemPerformance: '系统性能'
  },
  logout: {
    tip: '确定要退出吗?',
    title: '提示',
    yes: '确定',
    no: '取消'
  },
  login: {
    headline: '欢迎登陆系统',
    tip: '请输入您的账户和密码',
    placeholder: ['账户', '密码'],
    login: '登录',
    footer: '版权所有'
  },
  alarmHistory: {
    searchTitle: '历史告警列表查询',
    listTitle: '历史告警',
    searchForm: {
      label: ['范围选择', '确认警告', '日志信息'],
      placeholder: ['', '', '请输入日志信息']
    },
    tableLabel: [
      '序号',
      '告警级别',
      '告警类型',
      '告警名称',
      '详细信息',
      '发生时间',
      '确认时间',
      '操作'
    ],
    operationbtn: ['详情', '确认警报'],
    dialog: {
      title: '用户日志',
      formLabel: ['告警级别', '告警类型', '发生时间', '告警来源', '确认内容'],
      formPlaceholder: '请输入确认内容',
      default: {
        btn: '默认信息',
        msg: '异常信息已确认无问题，先确认OK。'
      }
    },
    detail: {
      title: '告警详情',
      label: [
        '告警级别',
        '告警类型',
        '告警来源',
        '简要描述',
        '详细信息',
        '账户名称',
        '用户名称',
        '确认信息'
      ],
      options: ['全部', '已确认', '未确认']
    }
  },
  alarmRealtime: {
    listTitle: '实时告警',
    tableLabel: [
      '序号',
      '告警级别',
      '告警标题',
      '告警来源',
      '有效时长',
      '产生时间',
      '操作'
    ],
    operationbtn: ['告警详情'],
    detail: {
      title: '告警详情',
      label: [
        '应用编号',
        '应用名称',
        '告警来源',
        '告警编号',
        '告警级别',
        '告警级别名称',
        '告警标题',
        '告警信息'
      ]
    }
  },
  batterInfo: {
    searchTitle: '电池类型列表查询',
    listTitle: '电池类型',
    searchForm: {
      label: ['设备名称', '信息名称', '电池序号', '模块电池序号'],
      placeholder: [
        '',
        '请输入信息名称',
        '请输入电池序号',
        '请输入模块电池序号'
      ]
    },
    tableLabel: [
      '序号',
      '电池名称',
      '电池序号',
      '模块电池序号',
      '记录时间',
      '操作'
    ],
    operationbtn: ['电压趋势'],
    dialog: {
      title: '电池详情',
      searchTitle: '电池类型列表查询',
      listTitle: '电池类型',
      formLabel: ['电池名称', '起止时间'],
      datePicker: {
        start: '开始日期',
        end: '结束日期',
        separator: '至'
      }
    }
  },
  batterManage: {
    searchTitle: '电池类型列表查询',
    listTitle: '电池类型',
    searchForm: {
      label: ['设备名称', '信息名称', '电池序号', '模块电池序号'],
      placeholder: [
        '',
        '请输入信息名称',
        '请输入电池序号',
        '请输入模块电池序号'
      ]
    },
    tableLabel: [
      '序号',
      '电池名称',
      '电池类型',
      '电池材料',
      '电池容量',
      '标准电压',
      '电池序号',
      '记录时间',
      '操作'
    ],
    editDialog: {
      title: '添加电池信息',
      formLabel: [
        '电池类型',
        '设备名称',
        '设备编号',
        '电池信息',
        '电池序号',
        '电池模块'
      ]
    },
    addDialog: {
      title: '添加电池信息',
      formLabel: [
        '电池类型',
        '设备名称',
        '设备编号',
        '电池信息',
        '电池序号',
        '电池模块'
      ]
    },
    addMultiple: {
      title: '添加电池信息',
      formLabel: [
        '电池类型',
        '设备名称',
        '设备编号',
        '电池名称头',
        'Bank选择',
        'Rack添加数量',
        'Cell添加数量',
        '电池模块起始序号'
      ]
    },
    errorTip: '请输入内容',
    delErrorTip: '请选择要删除的用户'
  },
  batteryAlarm: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    detail: ['电池报警', '报警电压']
  },
  batteryRealtime: {
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    listTitle: '设备管理',
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    operationbtn: ['显示数据'],
    dialog: {
      title: '显示数据',
      formLabel: ['设备名称', '识别号码', 'Bank序号', '数据类型', '原始数据'],
      table: [
        '起始地址',
        '第一列',
        '第二列',
        '第三列',
        '第四列',
        '第五列',
        '第六列',
        '第七列',
        '第八列',
        '第九列',
        '第十列'
      ]
    }
  },
  batteryState: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    operationbtn: ['硬件信息', '停机信息', '告警信息', '其他信息'],
    hardware: {
      title: '硬件信息',
      label: [
        '设备Bank',
        '项目编号',
        '主版本号',
        '子版本号',
        '修正版本号',
        '硬件主版本号',
        '硬件子版本号',
        'Bootloader主版本号',
        'Bootloader子版本号',
        'Bootloader修正版本号'
      ]
    },
    outage: {
      title: '停机信息',
      label: [
        '设备Bank',
        '单体过压停机次数',
        '电池过压停机次数',
        '电池充电过流停机次数',
        '单体欠压停机次数',
        '电池欠压停机次数',
        '电池放电过流停机次数',
        '电池过温停机次数',
        '电池欠温停机次数',
        '功率过温停机次数',
        '单体之间压差过大停机次数',
        '绝缘电阻值过小停机次数',
        '总压差过大停机次数'
      ]
    },
    alarm: {
      title: '告警信息',
      label: [
        '设备Bank',
        '单体过压告警次数',
        '电池过压告警次数',
        '电池充电过流告警次数',
        '单体欠压告警次数',
        '电池欠压告警次数',
        '电池放电过流告警次数',
        '电池过温告警次数',
        '电池欠温告警次数',
        '功率过温告警次数',
        '单体之间压差过大告警次数',
        '绝缘电阻值过小告警次数',
        '总压差过大告警次数',
        '环境温度过高告警次数',
        '环境温度过低告警次数'
      ]
    },
    others: {
      title: '其他信息',
      label: [
        '设备Bank',
        '电池循环次数',
        '电池总容量',
        '系统运行时间',
        '最近一次充电容量(0.01Ah)',
        '最近一次充电结束时间(秒)',
        '最近一次放电结束时间(秒)',
        '环境温度过高保护次数',
        '环境温度过低保护次数',
        '功率过温告警次数',
        '单体之间压差过大告警次数',
        '绝缘电阻值过小告警次数',
        '总压差过大告警次数',
        '环境温度过高告警次数',
        '环境温度过低告警次数'
      ]
    },
    detail: '主控自检状态'
  },
  batterySummary: {
    formLabel: '设备Bank',
    radioLabel: [
      {
        label: '总压曲线'
      },
      {
        label: '系统状态'
      },
      {
        label: '健康状态'
      },
      {
        label: '电压极值'
      },
      {
        label: '温度极值'
      },
      {
        label: '内阻极值'
      },
      {
        label: '绝缘曲线'
      }
    ]
  },
  batteryType: {
    searchTitle: '电池类型列表查询',
    listTitle: '电池类型',
    searchForm: {
      label: ['信息名称', '使用容量', '使用材料'],
      placeholder: ['请输入信息名称', '请输入使用容量', '请输入使用材料']
    },
    tableLabel: [
      '序号',
      '名称',
      '电池容量',
      '标准电压',
      '自放电率',
      '电池材料',
      '最大电压',
      '最小电压',
      '最大温度',
      '最小温度',
      '充电比率',
      '放电比率',
      '写入时间',
      '操作'
    ],
    editDialog: {
      title: '修改电池类型',
      label: [
        '电池名称',
        '电池容量',
        '电池内阻',
        '自放电率',
        '电池材料',
        '标准电压',
        '最大电压',
        '最小电压',
        '最大温度',
        '最小温度',
        '充电比率',
        '放电比率'
      ]
    },
    addDialog: {
      title: '添加电池类型',
      label: [
        '电池名称',
        '电池容量',
        '电池内阻',
        '自放电率',
        '电池材料',
        '标准电压',
        '最大电压',
        '最小电压',
        '最大温度',
        '最小温度',
        '充电比率',
        '放电比率'
      ]
    },
    errorTip: ['请输入内容', '请输入数字', '电池名称不能为空']
  },
  dataVisual: {
    box1: {
      title: ['总电气状态', '配置状态'],
      label: ['电池总电压', '电池总电流', '充电器输出电流', '系统标称总容量']
    },
    box2: {
      title: ['充电信息'],
      label: ['充放电指示', '充电容量', '充电结束时间', '放电结束时间'],
      unit: ['状态']
    },
    box3: {
      label: ['循环次数', '电池容量'],
      unit: ['次']
    },
    box4: {
      title: ['装机状态', '异常信息'],
      label: ['安装总簇数', '单体电池数量', '警告次数', '停机次数'],
      unit: ['簇', '节', '次', '次']
    },
    box5: {
      title: '极值信息',
      label: ['单体电压', '电池温度', '单体内阻', '正极绝缘', '负极绝缘']
    }
  },
  firstAlarm: {
    searchTitle: '设备基础信息',
    formLabel: ['设备Bank', '设备编号', 'ICCID编号', 'VIN编码', '设备名称'],
    tabs: ['电池一级报警', '电池二级报警'],
    tableLabel: [
      '序号',
      '单体过压',
      '系统过压',
      '充电过流',
      '单体欠压',
      '系统欠压',
      '放电过流',
      '充电温度过高',
      '充电温度过低',
      'SOC过低',
      '充电过流三级',
      '功率温度过高',
      '环境温度过高',
      '环境温度过低',
      '放电过流三级',
      '放电温度过高',
      '放电温度过低'
    ],
    state: ['正常', '告警']
  },
  selfCheck: {
    searchTitle: '设备基础信息',
    formLabel: ['设备Bank', 'ICCID编号', '设备编号', 'VIN编码', '设备名称'],
    tableLabel: [
      '序号',
      'EEPROM故障',
      '主控ID越界',
      'PCS待机失败',
      'FLASH自检状态'
    ],
    state: ['正常', '告警']
  },
  stateInfo: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID字符串',
      'VIN码',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    detail: ['状态曲线', '数据展示']
  },
  systemControl: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '展开操作'
    ],
    dialog: {
      title: '设备信息',
      label: ['设备编号', '设备名称', '设备Bank'],
      suffix: '信息'
    },
    unit: ['第', '簇'],
    detail: [
      '系统复位',
      '运行模式',
      '短路保护',
      '软关机',
      '绝缘采样',
      '从机ID自动分配',
      '故障码使能',
      '复位Eeprom',
      '反接保护',
      '启动测试',
      '被动均衡'
    ]
  },
  temperatureInfo: {
    searchTitle: '温度信息列表查询',
    listTitle: '温度信息',
    searchForm: {
      label: ['设备名称', '信息名称', '电池序号', '模块电池序号'],
      placeholder: [
        '',
        '请输入信息名称',
        '请输入电池序号',
        '请输入模块电池序号'
      ]
    },
    tableLabel: [
      '序号',
      '电池名称',
      '电池序号',
      '模块电池序号',
      '记录时间',
      '操作'
    ],
    operationbtn: ['详情'],
    dialog: {
      title: '温度详情',
      label: ['温度名称', '起止时间'],
      searchTitle: '温度类型列表查询',
      listTitle: '温度信息'
    }
  },
  temperatureManage: {
    searchTitle: '温度信息列表查询',
    listTitle: '温度信息',
    searchForm: {
      label: ['设备名称', '信息名称', '电池序号', '模块电池序号'],
      placeholder: [
        '',
        '请输入信息名称',
        '请输入电池序号',
        '请输入模块电池序号'
      ]
    },
    tableLabel: [
      '序号',
      '电池名称',
      '电池序号',
      '模块电池序号',
      '记录时间',
      '操作'
    ],
    editDialog: {
      title: '修改信息',
      formLabel: [
        '设备名称',
        '设备编号',
        '温度名称',
        '温度序号',
        '温度模块序号'
      ]
    },
    addDialog: {
      title: '添加电池信息',
      formLabel: [
        '设备名称',
        '设备编号',
        '温度名称',
        '温度序号',
        '温度模块序号'
      ]
    },
    addMore: {
      title: '添加电池信息',
      formLabel: [
        '设备名称',
        '设备编号',
        '温度名称头',
        'Bank选择',
        'Rack添加数量',
        'Cell添加数量',
        '温度序号头'
      ]
    },
    errorTip: '请输入内容',
    warningTip: '请选择要删除的用户'
  },
  thresholdSetting: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    dialog: {
      title: '设备信息',
      label: ['设备编号', '设备名称', '设备Bank'],
      suffix: '信息'
    },
    detail: ['电压门限', '充电一般门限', '充电过流门限', ''],
    list1: [
      '单体过压停机',
      '单体过压停机恢复',
      '总压过压停机',
      '总压过压停机恢复',
      '主回路充电过流停机',
      '主回路充电过流停机恢复',
      '单体欠停机压',
      '单体欠压停机恢复',
      '总压欠压停机',
      '总压欠压停机恢复',
      '主回路放电过流停机',
      '主回路放电过流停机恢复'
    ],
    list2: [
      '充电温度过高停机',
      '充电温度过高停机',
      '充电温度过低停机',
      '充电温度过低停机恢复',
      'SOC过低停机',
      'SOC过低停机恢复'
    ],
    list3: [
      '充电过流三级停机保护',
      '充电过流三级停机恢复',
      '放电过流三级停机保护',
      '放电过流三级停机恢复'
    ],
    list4: [
      '功率温度过高停机',
      '功率温度过高停机恢复',
      '绝缘失效停机',
      '绝缘失效停机恢复',
      '单体压差过高停机',
      '单体压差过高停机恢复',
      '总电压压差过高停机',
      '总电压压差过高停机恢复',
      '放电过温停机',
      '放电过温停机恢复',
      '放电欠温停机',
      '放电欠温停机恢复',
      '温差过高停机',
      '温差过高停机恢复',
      '环境温度过高停机',
      '环境温度过高停机恢复',
      '环境温度过低停机',
      '环境温度过低停机恢复'
    ]
  },
  vAlarm: {
    searchTitle: '设备基础信息',
    formLabel: ['设备Bank', 'ICCID编号', '设备编号', 'VIN编码', '设备名称'],
    tabs: ['电压信息', '温度信息', '其他信息'],
    volInfo: [
      '报警时最高电压电池编号',
      '报警时最高电压值',
      '停机时最高电压电池编号',
      '停机时最高电压值',
      '报警时最低电压电池编号',
      '报警时最低电压值',
      '停机时最低电压电池编号',
      '停机时最低电压值',
      '电池组过压报警时电压值',
      '电池组过压停机时电压值',
      '电池组欠压报警时电压值',
      '电池组欠压停机时电压值',
      '单体压差高告警值',
      '单体压差高停机值',
      '总压差高告警值',
      '总压差高停机值'
    ],
    temperatureInfo: [
      '报警时最高电池温度点编号',
      '报警时最高电池温度值',
      '停机时最高电池温度点编号',
      '停机时最高电池温度值',
      '报警时最低电池温度点编号',
      '报警时最低电池温度值',
      '停机时最低电池温度点编号',
      '停机时最低电池温度值',
      '报警时最高功率温度点编号',
      '报警时最高功率温度值',
      '停机时最高功率温度点编号',
      '停机时最高功率温度值',
      '单体温差高告警值',
      '单体温差高停机值'
    ],
    othersInfo: [
      '本支路运行状态',
      '设备故障报警信息',
      '电池充电过流报警时电流值',
      '电池充电过流停机时电流值',
      '电池放电过流报警时电流值',
      '电池放电过流停机时电流值',
      '绝缘过小告警阻值',
      '绝缘过小停机阻值'
    ],
    unit: ['第', '簇'],
    title: '名称'
  },
  service: {
    print: '打印条款'
  },
  serviceManage: {
    title: '服务条款',
    label: '语言类型',
    update: '更新'
  },
  workThreshold: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    dialog: {
      title: '设备信息',
      label: ['设备编号', '设备名称', '设备Bank'],
      suffix: '信息',
      unit: ['第', '簇']
    },
    detail: '系统复位'
  },
  batterDetail: {
    title: '设备信息',
    label: ['设备Bank', '设备ID', 'ICCID编号', '设备名称'],
    list: [
      'SOC实时状态',
      'SOH实时状态',
      '内阻实时状态',
      '电压实时状态',
      '温度实时状态'
    ]
  },
  batteryParams: {
    formLabel: [
      '电池组数量',
      '电池组1簇数量',
      '电池组2簇数量'
    ],
    unit: ['第', '簇电芯数量']
  },
  cmdList: {
    searchTitle: '命令流水列表查询',
    listTitle: '命令流水',
    searchForm: {
      label: ['范围选择', '命令参数', '命令类型'],
      placeholder: ['', '请输入命令参数', '请输入命令类型']
    },
    tableLabel: ['序号', '账户名称', '命令类型', '方法名称', '命令参数', '记录时间', '操作'],
    operationbtn: ['详情'],
    drawer: {
      title: '详细信息',
      label: ['账户名称', '对象名称', '方法名称']
    }
  },
  deviceDetail: {
    searchTitle: '设备基础信息',
    formLabel: ['设备编号', 'ICCID编号', '设备名称', '登记时间'],
    list: ['设备信息', '网络参数', '拓展参数', '串口参数', '挂载参数', '预设置电池参数', '电池参数']
  },
  deviceInfo: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    detail: ['设备详情', '电池详情', '状态详情', '功能详情']
  },
  deviceManage: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID字符串',
      'VIN码',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    dialog: {
      addTitle: '添加设备',
      editTitle: '修改设备',
      label: [
        'ICCID编码',
        '设备编号',
        'VIN编码',
        '设备名称',
        '设备管理员',
        '设备持有人'
      ]
    }
  },
  deviceUpgrade: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    operation: ['在线升级'],
    dialog: {
      label: [
        '设备名称',
        '系统代码',
        '设备编码',
        '更新目标',
        '文件名称',
        '升级结果'
      ],
      btn: ['导入文件', '取消等待', '关闭窗口'],
      unit: ['等待升级结果倒计时', '秒']
    }
  },
  equipmentInfo: {
    list1: [
      'DMS设备ID',
      '项目编号'
    ],
    list2: [
      'DMS硬件版本号',
      'DMS固件版本号',
      'RTC时间',
      'MAC地址',
      '本地DHCP开启状态',
      'DNS域名开启状态',
      'DNS域名获取状态',
      '扩展IP开启状态'
    ],
    state1: [
      '开启',
      '关闭'
    ],
    state2: [
      '已获取',
      '未获取'
    ]
  },
  equipmentManage: {
    searchTitle: '项目管理列表查询',
    listTitle: '项目管理',
    searchForm: {
      label: [
        '项目名称',
        '项目类型',
        '项目内容',
        '项目地点'
      ],
      placeholder: [
        '请输入项目名称',
        '请输入项目类型',
        '请输入项目内容',
        '请输入项目地点'
      ]
    },
    tableLabel: [
      '序号',
      '项目名称',
      '项目类型',
      '项目内容',
      '项目地点',
      '项目总投资',
      '计划完工时间',
      '操作'
    ],
    operation: [
      '编辑',
      '详情',
      '控制器',
      '删除'
    ],
    dialog: {
      editTitle: '修改项目',
      addTitle: '添加项目',
      label: [
        '项目名称',
        '项目类型',
        '项目规模',
        '项目内容',
        '项目地点',
        '项目总投资',
        '项目回报率',
        '项目回报周期',
        '项目描述',
        '计划完工时间'
      ]
    },
    drawer: {
      title: '项目详情',
      label: [
        '项目名称',
        '系统ID',
        '项目规模',
        '项目回报率',
        '项目回报周期',
        '项目描述',
        '项目添加时间'
      ]
    },
    transfer: {
      title: '控制器列表',
      state: [
        '不属于项目',
        '属于项目'
      ]
    }
  },
  funcInfo: {
    searchTitle: '设备基础信息',
    formLabel: [
      '设备Bank',
      '设备编号',
      'ICCID编号',
      '设备名称'
    ],
    tabs: [
      '告警功能',
      '保护功能'
    ],
    tableLabel: ['序号'],
    state: [
      '正常',
      '告警'
    ],
    unit: ['第', '簇'],
    list: [
      '单体过压',
      '系统过压',
      '充电过流',
      '单体欠压',
      '系统欠压',
      '放电过流',
      '充电温度过高',
      '充电温度过低',
      'SOC过低',
      '充电过流三级（无效）',
      '功率温度过高',
      '环境温度过高',
      '环境温度过低',
      '放电过流三级（无效）',
      '放电温度过高',
      '放电温度过低'
    ]
  },
  MountedParams: {
    formLabel: [
      'UPS数量',
      'PCS数量'
    ],
    label: [
      'UPS设备挂载状态',
      'PCS设备挂载状态',
      '发电机设备挂载状态',
      '联动模块挂载状态',
      '消防系统挂载状态',
      '光伏设备挂载状态',
      '风能设备挂载状态',
      '电池组设备挂载状态'
    ],
    state: [
      '已挂载',
      '未挂载'
    ]
  },
  networkParams: {
    list: [
      '本地IP协议类型',
      '本地IP获取方式',
      '本地客户端端口号',
      '本地静态IP地址',
      '本地子网掩码',
      '本地网关地址',
      '服务端IP获取方式',
      '服务端端口',
      '服务端静态IP',
      'DNS域名',
      'DNS1地址',
      'DNS2地址'
    ]
  },
  pcsInfo: {
    searchTitle: '设备管理列表查询',
    listTitle: '设备管理',
    searchForm: {
      label: ['ICCID编号', '设备编号', 'VIN编码', '设备名称'],
      placeholder: [
        '请输入ICCID编号',
        '请输入设备编号',
        '请输入VIN编码',
        '请输入设备名称'
      ]
    },
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID字符串',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    operation: [
      '运行状态',
      '控制状态',
      '电价状态'
    ]
  },
  pcsRealtime: {
    searchTitle: '设备信息',
    label: [
      'PCS编号',
      'ICCID编号',
      '设备编号',
      '设备名称',
      '设备名称'
    ],
    tabs: [
      '设备信息',
      '输入状态',
      '输出状态',
      '电池状态',
      '收益统计',
      '其他统计'
    ],
    list1: [
      '机器型号',
      '设备硬件版本',
      '设备软件版本',
      '触摸屏版本',
      '厂家信息'
    ],
    list2: [
      'U相电网电压',
      'V相电网电压',
      'W相电网电压',
      '电网频率',
      '交流漏电流',
      '并离网状态'
    ],
    list3: [
      '离网频率',
      '输出视在功率',
      '输出有功功率',
      '输出无功功率',
      'U相输出电压',
      'U相输出电流',
      'U相输出视在功率',
      'U相输出有功功率',
      'U相PF值',
      'U相负载量',
      'V相输出电压',
      'V相输出电流',
      'V相输出视在功率',
      'V相输出有功功率',
      'V相PF值',
      'V相负载量',
      'W相输出电压',
      'W相输出电流',
      'W相输出视在功率',
      'W相输出有功功率',
      'W相PF值',
      'W相负载量'
    ],
    list4: [
      '直流电压',
      '直流电流',
      '总直流功率',
      '电池组总电压',
      '电池组总电流',
      '电池组SOC',
      '电池组SOH'
    ],
    list5: [
      '总负载量',
      '当日充电量',
      '当日放电量',
      '当日收益',
      '总充电量',
      '总放电量',
      '总收益'
    ],
    list6: [
      '内部温度',
      '散热器温度',
      '当前电价',
      '可用功率',
      '远程控制状态',
      '充电限制电流',
      '放电限制电流',
      '充电限制电压',
      '放电限制电压',
      '充电可用电量',
      '放电可用电量'
    ]
  },
  controlStatus: {
    searchTitle: '设备信息',
    label: [
      'PCS编号',
      'ICCID编号',
      '设备编号',
      '设备名称',
      '设备名称'
    ],
    tabs: [
      '控制状态'
    ],
    list1: [
      '开关机设置',
      '模式自动切换',
      '主动孤岛使能',
      '计划曲线运行',
      'MPPT 模式'
    ],
    list2: [
      '功率因数',
      '无功功率设置',
      '手动并离网模式',
      '有功功率设置',
      '运行模式',
      '恒流模式电流',
      '无功运行模式',
      '紧急功率值'
    ],
    state: [
      '开机',
      '关机'
    ],
    state1: [
      '使能',
      '禁止'
    ],
    state2: [
      '开启',
      '关闭'
    ]
  },
  tariff: {
    searchTitle: '设备信息',
    label: [
      'PCS编号',
      'ICCID编号',
      '设备编号',
      '设备名称',
      '设备名称'
    ],
    tabs: [
      '时间分段',
      '分段功率',
      '电价状态'
    ],
    list1: [
      '系统时间',
      '时间段数',
      '第一段开始时间',
      '第一段结束时间',
      '第二段开始时间',
      '第二段结束时间',
      '第三段开始时间',
      '第三段结束时间',
      '第四段开始时间',
      '第四段结束时间',
      '第五段开始时间',
      '第五段结束时间',
      '第六段开始时间',
      '第六段结束时间',
      '第七段开始时间',
      '第七段结束时间',
      '第八段开始时间',
      '第八段结束时间',
      '第九段开始时间',
      '第九段结束时间',
      '第十段开始时间',
      '第十段结束时间',
      '第十一段开始时间',
      '第十一段结束时间',
      '第十二段开始时间',
      '第十二段结束时间'
    ],
    list2: [
      '第一段有功功率',
      '第一段无功功率',
      '第二段有功功率',
      '第二段无功功率',
      '第三段有功功率',
      '第三段无功功率',
      '第四段有功功率',
      '第四段无功功率',
      '第五段有功功率',
      '第五段无功功率',
      '第六段有功功率',
      '第六段无功功率',
      '第七段有功功率',
      '第七段无功功率',
      '第八段有功功率',
      '第八段无功功率',
      '第九段有功功率',
      '第九段无功功率',
      '第十段有功功率',
      '第十段无功功率',
      '第十一段有功功率',
      '第十一段无功功率',
      '第十二段有功功率',
      '第十二段无功功率'
    ],
    list3: [
      {
        list1: [
          '尖时时段数量',
          '尖时电价'
        ],
        list2: [
          '第一段尖时开始',
          '第一段尖时结束',
          '第二段尖时开始',
          '第二段尖时结束',
          '第三段尖时开始',
          '第三段尖时结束',
          '第四段尖时开始',
          '第四段尖时结束'
        ]
      },
      {
        list1: [
          '峰时时段数量',
          '峰时电价'
        ],
        list2: [
          '第一段峰时开始',
          '第一段峰时结束',
          '第二段峰时开始',
          '第二段峰时结束',
          '第三段峰时开始',
          '第三段峰时结束',
          '第四段峰时开始',
          '第四段峰时结束'
        ]
      },
      {
        list1: [
          '平时时段数量',
          '平时电价'
        ],
        list2: [
          '第一段平时开始',
          '第一段平时结束',
          '第二段平时开始',
          '第二段平时结束',
          '第三段平时开始',
          '第三段平时结束',
          '第四段平时开始',
          '第四段平时结束'
        ]
      },
      {
        list1: [
          '谷时时段数量',
          '谷时电价'
        ],
        list2: [
          '第一段谷时开始',
          '第一段谷时结束',
          '第二段谷时开始',
          '第二段谷时结束',
          '第三段谷时开始',
          '第三段谷时结束',
          '第四段谷时开始',
          '第四段谷时结束'
        ]
      }
    ]
  },
  pcsSettings: {
    operation: [
      '同步时间'
    ],
    confirm: {
      tip: '确定要同步时间吗',
      title: '提示',
      yes: '确定',
      no: '取消',
      canceled: '已取消'
    }
  },
  pcsEarnings: {
    formLabel: [
      '范围选择',
      '设备名称',
      'PCS'
    ],
    title: 'PCS收益总览'
  },
  onlineDevice: {
    tabs: [
      '在线设备',
      '在线Socket'
    ],
    tableLabel: [
      '序号',
      '设备ID',
      '设备名称',
      '远程终结点',
      '本地终结点',
      '设备注册类型',
      '设备最新注册时间'
    ],
    tableLabel1: [
      '序号',
      'Socket连接的本地总结点',
      'Socket远端终结点',
      '发送的总数据量',
      '接收的总数据量',
      '发送数据包的个数',
      '接收数据包的个数',
      '丢包率',
      '建立连接的时间',
      '收到数据最后更新时间'
    ]
  },
  preBatteryParams: {
    unit: [
      '第',
      '簇电芯数量'
    ],
    label: [
      '预设置电池组数量',
      '预设置电池组1簇数量',
      '预设置电池组2簇数量'
    ]
  },
  realtimeData: {
    tableLabel: [
      '序号',
      'ICCID',
      '设备ID',
      '设备名称',
      '设备管理员',
      '登记时间',
      '操作'
    ],
    listTitle: '设备管理',
    operation: [
      '显示数据'
    ],
    formLabel: [
      '设备名称',
      '识别号码',
      '数据类型',
      '原始数据'
    ],
    tableLabel1: [
      '起始地址',
      '第一列',
      '第二列',
      '第三列',
      '第四列',
      '第五列',
      '第六列',
      '第七列',
      '第八列',
      '第九列',
      '第十列'
    ]
  },
  register: {
    searchTitle: '注册流水列表查询',
    listTitle: '注册流水',
    formLabel: [
      '范围选择',
      '设备编码',
      'ICCID编号'
    ],
    placeholder: [
      '',
      '请输入设备编码',
      '请输入ICCID编号'
    ],
    tableLabel: [
      '序号',
      '系统ID',
      '设备唯一识别号',
      '名称',
      '最新注册时间',
      '操作'
    ],
    operation: [
      '详情'
    ],
    dialog: {
      title: '详细信息',
      order: [
        '排序：',
        '正序',
        '倒序'
      ],
      label: [
        '序号：',
        '类型：'
      ]
    }
  },
  selfInspection: {
    operation: [
      '召测'
    ],
    tip: '确定召测用户',
    title: '提示',
    yes: '确定',
    no: '取消',
    cancel: '已取消召测'
  },
  serialParams: {
    label: [
      '数据位',
      '停止位',
      '奇偶校验位'
    ]
  },
  historyMonitor: {
    label: '起始时间',
    unit: '小时'
  },
  cpuHistory: [
    '处理器Cpu时间',
    'Cpu特权时间',
    'Cpu中断时间',
    'Cpu DPC时间'
  ],
  diskHistory: [
    '读硬盘速度',
    '写硬盘速度',
    '磁盘平均读取时间',
    '磁盘平均写入时间',
    '硬盘队列长度',
    '磁盘时间'
  ],
  memoryHistory: [
    '可用内存',
    '通用内存',
    '内存使用比例',
    '内存缓存'
  ],
  networkHistory: [
    '网络流量发送',
    '网络流量接收'
  ],
  othersHistory: [
    '内存池分页',
    '内存池未分页',
    '页面文件',
    '内容切换'
  ],
  systemHistory: [
    '系统句柄数',
    '系统线程数',
    '系统调用',
    '系统队列长度'
  ],
  exception: {
    searchTitle: '异常日志列表查询',
    listTitle: '异常日志',
    formLabel: [
      '范围选择',
      '异常名称',
      '异常信息'
    ],
    placeholder: [
      '',
      '请输入异常名称',
      '请输入异常信息'
    ],
    tableLabel: [
      '序号',
      '异常名称',
      '发生时间',
      '异常方法',
      '异常编码',
      '异常信息',
      '记录时间',
      '操作'
    ],
    operation: [
      '详情'
    ],
    dialog: {
      title: '详细信息',
      label: [
        '异常系统',
        '对象名称',
        '异常链接',
        '表示形式',
        '异常方法',
        '异常消息',
        '异常编码',
        '发生时间',
        '记录时间'
      ]
    }
  },
  hardware: {
    searchTitle: '硬件日志列表查询',
    listTitle: '硬件日志',
    formLabel: [
      '范围选择',
      '日志类型',
      '日志信息'
    ],
    placeholder: [
      '',
      '',
      '请输入日志信息'
    ],
    tableLabel: [
      '序号',
      '日志类型',
      '终端时间',
      '日志信息',
      '发生时间',
      '记录时间'
    ],
    dialog: {
      title: '用户日志',
      unit: [
        '参数',
        '值'
      ]
    }
  },
  systemLog: {
    searchTitle: '系统日志列表查询',
    listTitle: '系统日志',
    tableLabel: [
      '序号',
      '日志类型',
      '日志信息',
      '发生时间',
      '记录时间',
      '日志参数'
    ]
  },
  userlog: {
    searchTitle: '用户日志列表查询',
    listTitle: '用户日志',
    tableLabel: [
      '序号',
      '日志类型',
      '登录序号',
      '登录地址',
      '本机IP',
      '日志信息',
      '发生时间',
      '操作'
    ],
    operation: [
      '详情'
    ],
    dialog: {
      title: '日志详情',
      label: [
        '日志类型',
        '登录序号',
        '外网地址',
        '内网地址',
        '客户端地址',
        '客户端属地',
        '主机名称',
        '语言类型',
        '浏览器类型',
        '浏览器版本',
        '服务器地址',
        '开始时间',
        '结束时间',
        '记录时间'
      ]
    }
  },
  loginLog: {
    searchTitle: '模糊查询',
    listTitle: '登录记录',
    searchForm: {
      label: [
        '范围选择',
        '用户选择',
        '网络地址'
      ]
    },
    tableLabel: [
      '序号',
      '账户',
      '名称',
      '地区',
      '网络地址',
      '户籍',
      '操作系统',
      '浏览器',
      '登录时间',
      '操作'
    ],
    operation: [
      '操作记录'
    ]
  }
}
